Revit 2027 API
ParameterTypeId.SteelElemHoleTapping Property
 "Right-handed thread"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId SteelElemHoleTapping { get; }
Public Shared ReadOnly Property SteelElemHoleTapping As ForgeTypeId
	Get
public:
static property ForgeTypeId^ SteelElemHoleTapping {
	ForgeTypeId^ get ();
}
static member SteelElemHoleTapping : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace